Revit 2027 API
RebarShapeConstraint.GetParamId Method
 Return the Id of the parameter associated with this constraint.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementId GetParamId()
Public Function GetParamId As ElementId
public:
ElementId^ GetParamId()
member GetParamId : unit -> ElementId
Return Value
ElementId
 The Id of the parameter, or InvalidElementId if the constraint does not have one.
Remarks
 Most subclasses of RebarShapeConstraint require a parameter.
See Also
Reference
RebarShapeConstraint Class
Autodesk.Revit.DB.Structure Namespace